// создать два типа переменных 

// Запросить у пользователя возраст(prompt), 
// если младше 18 - вывести "Школьник", если больше "Студент"
// ветвление любым способом.

// Вывести 10 целых рандомных чисел с помощью while и с помощью for

// Реализовать калькулятор с помощью switch case 

// ***let num = Math.floor(Math.random() * (max - min + 1)) + min;
// получение целого рандомного числа👆 max и min заменить своими значениями 
// max - верхняя границ, min - нижняя граница
// let num = Math.round(Math.random(100)*100)
// Ещё способ получение целого рандомного числа. 100 - 
// это диапазон от 1 до 100 и умножить нужно на этот же диапазон.

// Читаем https://learn.javascript.ru/function-basics  <- Функции



//////////////////////////  Будет позже :)


