// Выдано 26.10.2023

// Задача: Создание класса "Автомобиль"

// Создайте класс "Автомобиль", который имеет следующие свойства и методы:

// 1. Свойства:
//    - Марка (например, "Toyota").
//    - Модель (например, "Camry").
//    - Год выпуска.
//    - Скорость (начально равна 0).
//    - Заведен ли двигатель (начально false).

// 2. Методы:
//    - завестиДвигатель(): Метод, который заводит двигатель автомобиля. Если двигатель уже заведен, вывести сообщение об этом. В противном случае, установить флаг "двигатель заведен" в true.
//    - выключитьДвигатель(): Метод, который выключает двигатель автомобиля. Если двигатель уже выключен, вывести сообщение об этом. В противном случае, установить флаг "двигатель заведен" в false.
//    - увеличитьСкорость(скорость): Метод, который увеличивает текущую скорость автомобиля на указанное значение "скорость". Если двигатель не заведен, вывести сообщение об этом.
//    - уменьшитьСкорость(скорость): Метод, который уменьшает текущую скорость автомобиля на указанное значение "скорость". Если двигатель не заведен, вывести сообщение об этом.
//    - отобразитьИнформацию(): Метод, который выводит в консоль информацию об автомобиле, включая марку, модель, год выпуска, текущую скорость и состояние двигателя.

// Создайте экземпляр класса "Автомобиль", выполните несколько действий с ним (заведите двигатель, увеличьте скорость, и т.д.) и отобразите информацию о нем.еопределить метод() выводит Тяф-Тяф!