// 1. Сумма элементов массива: Напишите функцию, которая находит сумму всех элементов в числовом массиве.

const sum = [1,4,5,7,10].reduce((acc,item) => acc + item, 0)





// 2. Нахождение максимального элемента: Напишите функцию, которая находит максимальный элемент в числовом массиве.

const arr = [1,884,-25,7,110]
const max = Math.max(...arr)






// 3. Фильтрация массива: Создайте функцию, которая фильтрует массив строк и возвращает только строки, длина которых больше заданного значения.
const title = ["HTML", "JavaScript", 6, 10, "CSS", 5]


for(let index in title){
    console.log(title[index])

    typeof(title[index]) == String
}





sololearn - сайт











// 4. Поиск элемента в массиве: Напишите функцию, которая проверяет, существует ли определенный элемент в массиве.

// 5. Объединение массивов: Напишите функцию, которая объединяет два массива в один.

// 6. Удаление дубликатов: Создайте функцию, которая удаляет дубликаты из массива.

// 7. Сортировка массива: Реализуйте сортировку массива чисел по возрастанию и убыванию.

// 8. Преобразование элементов массива: Напишите функцию, которая умножает каждый элемент числового массива на заданное число.

// 9. Подсчет количества определенных элементов: Создайте функцию, которая подсчитывает количество определенных элементов в массиве.

// 10. Обратный порядок элементов: Напишите функцию, которая изменяет порядок элементов в массиве на обратный.