// 1. Сумма элементов массива: Напишите функцию, 
// которая находит сумму всех элементов в числовом массиве.
// *reduce

// 2. Нахождение максимального элемента: Напишите функцию, 
// которая находит максимальный элемент в числовом массиве.
// return Match.max(...arr)

// 3. Фильтрация массива: Создайте функцию, которая фильтрует 
// массив строк и возвращает только строки, длина которых 
// больше заданного значения.
// *filter

// 4. Поиск элемента в массиве: Напишите функцию, которая 
// проверяет, существует ли определенный элемент в массиве.
// *includes || indexOf

// 5. Объединение массивов: Напишите функцию, которая 
// объединяет два массива в один.
// *contact

// - 6. Удаление дубликатов: Создайте функцию, которая 
// удаляет дубликаты из массива.

// 7. Сортировка массива: Реализуйте сортировку массива чисел по 
// возрастанию и убыванию.
// .slice().sort()

// 8. Преобразование элементов массива: Напишите функцию, 
// которая умножает каждый элемент числового массива на 
// заданное число.
// .map

// 9. Подсчет количества определенных элементов: Создайте 
// функцию, которая подсчитывает количество определенных элементов в массиве.
// .reduce

// 10. Обратный порядок элементов: Напишите функцию, 
// которая изменяет порядок элементов в массиве на обратный.
// .slice().reverse()
