// выдано 26.09.2023

// Task1:
// Сумма пользовательских чисел.
// Создайте скрипт, который запрашивает ввод двух 
// чисел (используйте prompt) и после показывает их сумму.

// Task2:
// Создайте функцию readNumber, которая будет запрашивать 
// ввод числового значения до тех пор, пока посетитель его 
// не введёт.
// Функция должна возвращать числовое значение.
// Также надо разрешить пользователю остановить процесс 
// ввода, отправив пустую строку или нажав «Отмена». 
// В этом случае функция должна вернуть null.

// Task3:
// Напишите функцию random(min, max), которая генерирует 
// случайное число с плавающей точкой от min до max 
// (но не включая max).

// Task4:
// Напишите функцию randomInteger(min, max), которая 
// генерирует случайное целое (integer) число от min до 
// max (включительно).
